# BaseOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..BaseOffset Property
Space Class See Also
---
Get or set the Base Offset of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double BaseOffset { get; set; }
```

Visual Basic
---
```text
Public Property BaseOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
```

# Remarks
This property is used to get or set the Base Offset of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace